Documents/РедактированиеРаботУРВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РедактированиеРаботУРВ</Name>
			<Comment>Редактирование работ УРВ</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Конец</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПакетРабот</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродолжительностьРаботы</Name>
							<Comment>Продолжительность работы с учётом перерыва</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродолжительностьПерерыва</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПерерыва</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПерерыва</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтарыеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОтметки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОтметокВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказНаряд</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продолжительность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПакетРабот</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РегистрацияВремениРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РегистрацияВремениРабот</Name>
			<Comment>Регистрация времени работ</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КонецРаботы</Name>
					<Comment>Конец работы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПакетРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Comment>Рабочее место</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОтметки</Name>
					<Comment>Вид отметки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтметокВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Comment>Заказ-наряд</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/РедактированиеРаботУРВ/Ext/ObjectModule.bsl
// Модуль документа РабочийЛист

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/атрикула в ТЧ
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
Перем СписокВидовКонтактов Экспорт;				// Список видов контактов
Перем СписокКомуПокупает Экспорт;				// Список назначения покупки
Перем СписокСКемПришел Экспорт;					// Список сопровождающих клиента
Перем СписокСроков Экспорт;						// Список сроков сделки
Перем СписокСтатусов Экспорт;					// Список статусов рабочего листа

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	                     
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ЗаказНаряд",1);
	
	
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	Возврат Результат;	
КонецФункции // ПроверитьКорректность()

// Проверяет корректность заполнения табличных частей объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
Функция ПроверитьЗаполненностьТЧ(Ошибки="", ДопРеквизиты=Неопределено) Экспорт
	//Документ считаем корректно заполненным, независимо от заполненности табличных частей
	Возврат Истина;
КонецФункции

// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Вовращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("РабочийЛист","Рабочий лист",Истина);

	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка			– Имя реквизита документа с полным путем (например Тавары.Номенклатура).
//  ЭтаФорма	– Форма				– Ссылка на форму документа. Если значение неопределено, производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Стркутура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
     Возврат Истина;
КонецФункции // ОбработкаРеквизита()

// Функция возвращает сотрудника на основании переданного пользователя
//
Функция ПолучитьСотрудникаПоПользователю(ТекущийПользователь) Экспорт
	ТекущийСотрудник	= Справочники.Сотрудники.ПустаяСсылка();
	
	Если НЕ обЗначениеНеЗаполнено(ТекущийПользователь) И НЕ ПустаяСтрока(ТекущийПользователь.Наименование) Тогда
		Если обЗначениеНеЗаполнено(ТекущийПользователь.Сотрудник) Тогда
			ТекущийСотрудник	= Справочники.Сотрудники.НайтиПоНаименованию(ТекущийПользователь.Наименование, Истина);
			Если обЗначениеНеЗаполнено(ТекущийСотрудник) Тогда
				// Создадим нового сотрудника
				СотрудникОбъект	= Справочники.Сотрудники.СоздатьЭлемент();
				СотрудникОбъект.УстановитьНовыйКод();
				СотрудникОбъект.Наименование	= ТекущийПользователь.Наименование;
				СотрудникОбъект.Организация= ПараметрыСеанса.Организация;
				СотрудникОбъект.Подразделение	= ПараметрыСеанса.ПодразделениеКомпании;
				СотрудникОбъект.Должность		= Справочники.Должности.Неопределена;
				Попытка
					СотрудникОбъект.Записать();
					ТекущийСотрудник	= СотрудникОбъект.Ссылка;
				Исключение КонецПопытки;
			КонецЕсли;
		Иначе
			ТекущийСотрудник	= ТекущийПользователь.Сотрудник;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекущийСотрудник;
КонецФункции

#Если Клиент Тогда

// Функция возвращает данные о контактах с клиентом
//
Функция ПолучитьДанныеОКонтактах(Режим=1, ТолькоОднаЗапись=Истина,ВидСобытия=Неопределено) Экспорт
	Возврат зфРабочийЛистПолучитьДанныеОКонтактах(ЭтотОбъект,Режим,ТолькоОднаЗапись,ВидСобытия);
КонецФункции
	
// Расчет общей балансовой стоимости активов
//
// Возвращаемое значение:
//  СуммаВсего - число - итог по колонке "БалансоваяСтоимость".
//
Функция РассчитатьСуммуВсего() Экспорт
	// Если выбран авто - то “Сумма продажи” включает опции,
	// если выбрана “Модель+Вариант комплектации” - то “Сумма продажи” не включает сумму опций
	//Если (НЕ обЗначениеНеЗаполнено(Модель)) И (НЕ обЗначениеНеЗаполнено(ВариантКомплектации)) Тогда
	//	СуммаВсего = СуммаПродажи+Опции.Итог("СуммаВсего");
	//Иначе
	//	СуммаВсего = СуммаПродажи;
	//КонецЕсли;
	Возврат 0;
КонецФункции // РассчитатьСуммуВсего()

// Выводит сумму по табличной части документа
//
// Параметры:
// ЭтаФорма - форма, форма документа
//
Процедура ВывестиЗаголовокСуммаДокумента(ЭтаФорма) Экспорт
	
	Попытка
		ВремСумма = РассчитатьСуммуВсего();
	Исключение
		ВремСумма	= 0;
	КонецПопытки;
		
	// обновим надпись валюты и суммы документа
	ТекстВалюта = "";
	Попытка	
		ТекстВалюта = "Валюта: " + СокрЛП(ЭтаФорма.ВалютаДокумента) + " (" + Формат(ЭтаФорма.КурсДокумента,"ЧДЦ = 4") + ")";
		Попытка
			Если ВремСумма <> Неопределено Тогда
				ТекстСумма = " ИТОГО: " + Формат(ВремСумма,"ЧДЦ = 2; ЧН = 0,00");
			КонецЕсли; 
		Исключение
		КонецПопытки;
		ЭтаФорма.ЭлементыФормы.тСуммаДокумента.Заголовок = ТекстВалюта + ТекстСумма;
	Исключение 
	КонецПопытки;
	
	// здесь же установим подписи количества строк в заголовках страниц основной панели
	ТекстЦена = ""; ТекстСкидка = "";
	Попытка
		ТекстЦена = ?(обЗначениеНеЗаполнено(ЭтаФорма.ТипЦен)," < не указан > ",СокрЛП(ЭтаФорма.ТипЦен.Наименование));
	Исключение КонецПопытки;
	ТекстСкидка = "";
	
	Мет = ЭтаФорма.ЭтотОбъект.Метаданные();
	Для Каждого ТаблЧасть Из Мет.ТабличныеЧасти Цикл
		Попытка ЭтаФорма.ЭлементыФормы.ОсновнаяПанель.Страницы[ТаблЧасть.Имя].Заголовок = СокрЛП(ТаблЧасть.Синоним) + " (" + СокрЛП(ЭтаФорма[ТаблЧасть.Имя].Количество()) + " поз.)"; Исключение КонецПопытки;
		// и тут же попытаемся установить текст подвала для колоники "Номенклатура"
		Попытка
			ЭтаФорма.ЭлементыФормы[ТаблЧасть.Имя].Колонки.Цена.ТекстПодвала = ТекстЦена;
		Исключение КонецПопытки;
		Попытка
			ЭтаФорма.ЭлементыФормы[ТаблЧасть.Имя].Колонки.Номенклатура.ТекстПодвала = ?(ПустаяСтрока(ТекстСкидка),"",ТекстСкидка);
		Исключение КонецПопытки;
	КонецЦикла; 
КонецПроцедуры // ВывестиЗаголовокСуммаДокумента()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА
 // Возвращает доступные варианты печати документа
// Вовращаемое значение: 
//  Струткура, каждая строка которой
//  соответствует одному из вариантов печати
//  Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм() Экспорт
	СтруктураМакетов=Новый Структура();
	//СтруктураМакетов.Вставить("РабочийЛист",			"Рабочий лист");
	//СтруктураМакетов.Вставить("РабочийЛистЗвонка",		"Рабочий лист звонка");
	//СтруктураМакетов.Вставить("РабочийЛистВстречи",		"Рабочий лист встречи");
	//СтруктураМакетов.Вставить("КоммерческоеПредложение","Коммерческое предложение");
	Возврат СтруктураМакетов;
КонецФункции // ПолучитьСписокПечатныхФорм()

#КонецЕсли

// Процедура заполнения табличной части по комплектации
//
Процедура ЗаполнитьКомплектациюАвтомобиля() Экспорт
	// таблица комплектации
	//Перем табКомплектация;
	//
	//Если НЕ ЗначениеЗаполнено(Автомобиль) Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//#Если Клиент Тогда
	//	Если (Опции.Количество() <> 0) Тогда
	//		// зададим вопрос
	//		Ответ = Вопрос("Очищать табличные части опции?",РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Да);
	//		Если Ответ = КодВозвратаДиалога.Отмена Тогда
	//			Возврат;
	//		ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
	//			Опции.Очистить();
	//		КонецЕсли;
	//	КонецЕсли;
	//#КонецЕсли
	//
	//// получим таблицу комплектации
	//НайденыйАвтомобильОбъект = Автомобиль.ПолучитьОбъект();
	//Рез = НайденыйАвтомобильОбъект.ПолучитьОпицииИОборудованиеАвтомобиля(табКомплектация);
	//
	////если нет данных выйдем
	//Если НЕ Рез Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//// заполнияем ТЧ
	//Для Каждого стрКомплектации Из табКомплектация Цикл
	//	Если ТипЗнч(стрКомплектации.Номенклатура) = Тип("СправочникСсылка.Опции") Тогда
	//		// добавление в опции
	//		НоваяСтрока				= Опции.Добавить();
	//		НоваяСтрока.Опция		= стрКомплектации.Номенклатура;
	//		ОбработкаРеквизита("Опции.Опция", НоваяСтрока);
	//		НоваяСтрока.Количество	= стрКомплектации.КоличествоОстаток;
	//		НоваяСтрока.СуммаВсего	= обПересчет(стрКомплектации.СуммаУпрОстаток, Константы.ВалютаУправленческогоУчетаКомпании.Получить(), ?(обЗначениеНеЗаполнено(КурсВалютыУпр), Дата, КурсВалютыУпр),ВалютаДокумента,Дата,РежимОкругления.Окр15как20);
	//		ОбработкаРеквизита("Опции.СуммаВсего", НоваяСтрока);
	//	КонецЕсли;
	//КонецЦикла;
	//
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
// Обработчик события при установке новго номера
//
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события заполнения
//
Процедура ОбработкаЗаполнения(Основание) Экспорт
	Если ТипЗнч(Основание)=Тип("Структура") Тогда	
		ИмяСтруктуры = Неопределено;
		Основание.Свойство("Имя", ИмяСтруктуры);
		Если ИмяСтруктуры="РегистрацияЗвонковИКонтактов" Тогда	
			ВидКонтакта						= Основание.ВидКонтакта;
			ДатаПоследнегоКонтакта			= Основание.ДатаДень;
			СодержаниеПоследнегоКонтакта	= Основание.Примечание;
			Менеджер						= Основание.Сотрудник;
			Реклама							= Основание.Реклама;			
			Модель							= Основание.Модель;
			Контрагент						= Основание.Контрагент;
			РуководительМенеджера   		= Основание.РуководительМенеджера;
            //Гэндальф+++
			
			КонтактныйТелефон =    Основание.КонтактныйТелефон ;
			//Гэндальф---
			ОбработкаРеквизита("Контрагент");
			Если НЕ обЗначениеНеЗаполнено(Контрагент) Тогда
				Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
					НаименованиеКлиента			= Контрагент.Наименование;
				ИначеЕсли ТипЗнч(Контрагент) = Тип("Строка") Тогда
					НаименованиеКлиента = Контрагент;	
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ИмяСтруктуры="Автомобиль" Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	
	Если ТипЗнч(Основание)=Тип("ДокументСсылка.Событие") Тогда 	
		//Пользователи.Загрузить(Основание.Пользователи.Выгрузить());
	КонецЕсли;
	
	// Если пользователей нет, то добавим текущего пользователя.
	//Если Пользователи.Количество()=0 Тогда			
	//	СтрокаПользователь				= Пользователи.Добавить();
	//	СтрокаПользователь.Пользователь	= ПараметрыСеанса.Пользователь; 			
	//КонецЕсли;
	
	#Если Клиент Тогда
	зфРабочийЛистОбработкаЗаполнения(ЭтотОбъект,Основание);
	#Иначе
	зфЗащищенныеФункцииСервер.РабочийЛистОбработкаЗаполнения(ЭтотОбъект,Основание);
	#КонецЕсли
	
	Если обЗначениеНеЗаполнено(Менеджер) Тогда
		ТекущийСотрудник = ПолучитьСотрудникаПоПользователю(ПараметрыСеанса.Пользователь);
		Менеджер = ТекущийСотрудник;
		ОбработкаРеквизита("Менеджер");
	КонецЕсли;
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события при копировании
//
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

// Обработчик события перед записью
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередЗаписью()

// Обработчик события при записи
//
Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриЗаписи()

// Обработчик события перед удалением
//
Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

// Обработчик события удаления проведения
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события проведения
//
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
	Если СтарыеДанные.Количество()=0 тогда
		ЗАпрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РегистрацияВремениРабот.Период,
		|	РегистрацияВремениРабот.Сотрудник,
		|	РегистрацияВремениРабот.ВидОтметки,
		|	РегистрацияВремениРабот.ЗаказНаряд,
		|	РегистрацияВремениРабот.КонецРаботы,
		|	РегистрацияВремениРабот.Продолжительность,
		|	РегистрацияВремениРабот.ПакетРабот,
		|	РегистрацияВремениРабот.РабочееМесто
		|ИЗ
		|	РегистрСведений.РегистрацияВремениРабот КАК РегистрацияВремениРабот
		|ГДЕ
		|	РегистрацияВремениРабот.ЗаказНаряд = &ЗаказНаряд"  ;
		Запрос.УстановитьПараметр("ЗаказНаряд",ЗаказНаряд);
		
		СтарыеДанные.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;	
	
	//// Модификацию регистров пока не делаем, далее - будет видно 
	//НаборЗаписейФактическоеВремя = РегистрыСведений.РегистрацияВремениРабот.СоздатьНаборЗаписей();
	//НаборЗаписейФактическоеВремя.Отбор.ЗаказНаряд.Установить(ЗаказНаряд);
	//НаборЗаписейФактическоеВремя.Прочитать();
	//НаборЗаписейФактическоеВремя.Очистить();
	//НаборЗаписейФактическоеВремя.Записать();	
	//
	//НаборЗаписейФактическоеВремя = РегистрыСведений.РегистрацияВремениРабот.СоздатьНаборЗаписей();
	//НаборЗаписейФактическоеВремя.Отбор.ЗаказНаряд.Установить(ЗаказНаряд);
	//НаборЗаписейФактическоеВремя.Прочитать();
	//
	//Для Каждого стр из Работы цикл
	//	Движение = НаборЗаписейФактическоеВремя.Добавить();
	//	Движение.Период = стр.Начало;
	//	Движение.ЗаказНаряд = ЗаказНаряд;
	//	Движение.Сотрудник = стр.Сотрудник;
	//	Движение.ВидОтметки =Справочники.ВидыОтметокВремени.Работа;
	//	Движение.КонецРаботы = стр.Начало  ;
	//	Движение.ПакетРабот = стр.ПакетРабот;
	//	Движение.РабочееМесто =    стр.РабочееМесто ;
	//	Движение.Продолжительность =    стр.ПродолжительностьРаботы ;
	//	
	//	Движение = НаборЗаписейФактическоеВремя.Добавить();
	//	Движение.Период = стр.Конец;
	//	Движение.ЗаказНаряд = ЗаказНаряд;
	//	Движение.Сотрудник = стр.Сотрудник;
	//	Движение.ВидОтметки =Справочники.ВидыОтметокВремени.Работа;
	//	Движение.КонецРаботы = стр.Конец  ;
	//	Движение.ПакетРабот = стр.ПакетРабот;
	//	Движение.РабочееМесто =    стр.РабочееМесто ;
	//	Движение.Продолжительность =    стр.ПродолжительностьПерерыва ;
	//КонецЦикла;	
	//НаборЗаписейФактическоеВремя.Записать();
	//
	//НаборЗаписейФактическоеВремя = РегистрыСведений.УРВ_ФактическоеВремяРабот.СоздатьНаборЗаписей();
	//НаборЗаписейФактическоеВремя.Отбор.ЗаказНаряд.Установить(ЗаказНаряд);
	//НаборЗаписейФактическоеВремя.Прочитать();
	//НаборЗаписейФактическоеВремя.Очистить();
	//НаборЗаписейФактическоеВремя.Записать();	
	//
	//НаборЗаписейФактическоеВремя = РегистрыСведений.УРВ_ФактическоеВремяРабот.СоздатьНаборЗаписей();
	//НаборЗаписейФактическоеВремя.Отбор.ЗаказНаряд.Установить(ЗаказНаряд);
	//НаборЗаписейФактическоеВремя.Прочитать();
	//
	//Для Каждого стр из Работы цикл	
	//	Движение = НаборЗаписейФактическоеВремя.Добавить();
	//	Движение.Период = стр.Конец;
	//	Движение.ЗаказНаряд = ЗаказНаряд;
	//	Движение.Сотрудник = стр.Сотрудник;
	//	//Движение.ВидОтметки =Справочники.ВидыОтметокВремени.Работа;
	//	//Движение.КонецРаботы = стр.Конец  ;
	//	Движение.ПакетРабот = стр.ПакетРабот;
	//	Движение.РабочееМесто =    стр.РабочееМесто ;
	//	Движение.Время =    стр.ПродолжительностьПерерыва + стр.ПродолжительностьРаботы ;
	//	Движение.Работа =    стр.Работа ;		
	//КонецЦикла;	
	//
	//НаборЗаписейФактическоеВремя.Записать()  ;
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
КонецПроцедуры // ОбработкаПроведения()

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

//// Вид контакта
//СписокВидовКонтактов	= Новый СписокЗначений();
//СписокВидовКонтактов.Добавить(Перечисления.ВидыСобытий.ЛичнаяВстреча, "Личная встреча",,БиблиотекаКартинок.СобытияВстреча16);
//СписокВидовКонтактов.Добавить(Перечисления.ВидыСобытий.ТелефонныйЗвонок, "Телефонный звонок",,БиблиотекаКартинок.СобытияЗвонок16);
//СписокВидовКонтактов.Добавить(Перечисления.ВидыСобытий.Прочее, "Прочее",,БиблиотекаКартинок.ПрочееСобытие);

//// Кому покупает
//СписокКомуПокупает	= Новый СписокЗначений();
//СписокКомуПокупает.Добавить("Себе");
//СписокКомуПокупает.Добавить("Жене");
//СписокКомуПокупает.Добавить("Детям");
//СписокКомуПокупает.Добавить("Родственникам");

//// С кем пришел
//СписокСКемПришел	= Новый СписокЗначений();
//СписокСКемПришел.Добавить("Один");
//СписокСКемПришел.Добавить("С женой");
//СписокСКемПришел.Добавить("С семьей");
//СписокСКемПришел.Добавить("С другом");
//СписокСКемПришел.Добавить("С родственником");

//// Предполагаемый строк
//СписокСроков	= Новый СписокЗначений();
//СписокСроков.Добавить("Сегодня");
//СписокСроков.Добавить("Неделя");
//СписокСроков.Добавить("Месяц");
//СписокСроков.Добавить("Полгода");
//СписокСроков.Добавить("Год");

//// Список статусов рабочего листа
//СписокСтатусов	= Новый СписокЗначений;
//ЗапросСтатусов		= Новый Запрос();
//ЗапросСтатусов.Текст= "ВЫБРАТЬ
//					  |	СтатусыРабочегоЛиста.Ссылка КАК Ссылка,
//					  |	СтатусыРабочегоЛиста.Наименование КАК Наименование
//					  |ИЗ
//					  |	Справочник.СтатусыРабочегоЛиста КАК СтатусыРабочегоЛиста
//					  |ГДЕ
//					  |	СтатусыРабочегоЛиста.ИспользоватьВРабочемЛисте
//					  |	И НЕ СтатусыРабочегоЛиста.ПометкаУдаления";
//ВыборкаСтатусов	= ЗапросСтатусов.Выполнить().Выбрать();
//Пока ВыборкаСтатусов.Следующий() Цикл
//	СписокСтатусов.Добавить(ВыборкаСтатусов.Ссылка);	
//КонецЦикла;
//СписокСтатусов.СортироватьПоПредставлению();

// сохранение ссылки на коллекцию прав, настроек и окружения
Права                 = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
